Revit 2027 API
ParameterTypeId.FbxLightSourceDiameter Property
 "Light Source Symbol Size"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FbxLightSourceDiameter { get; }
Public Shared ReadOnly Property FbxLightSourceDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FbxLightSourceDiameter {
	ForgeTypeId^ get ();
}
static member FbxLightSourceDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace